import React from "react";
import { Text, View, ScrollView } from "react-native";
import { ThemeContext } from "/components/ThemeProvider";
import { FontSizeContext } from "/components/FontSizeProvider";
import Accordion from "/components/Accordion";
import Bullet from "/components/Bullet";
import Header from "/components/Header";
import Paragraph from "/components/Paragraph";
import resolveStyles from "/styles/subpage";

export default function Igry({ navigation }) {
  const { computeTheme } = React.useContext(ThemeContext);
  const { computeFontSize } = React.useContext(FontSizeContext);
  const styles = resolveStyles(computeTheme(), computeFontSize);
  return (
    <View>
      <Header backButton navigation={navigation} />
      <ScrollView>
        <View style={styles.container}>
          <Text style={styles.header}>Ігри та вправи для зняття стресу у дітей </Text>
          <Paragraph style={{ paddingBottom: 20 }}>
            Гра – це основний вид діяльності дітей, метод дитини в пізнанні світу.
            Завдяки грі дитина вчиться спілкуватися з однолітками, дотримуватися правила, поступатися, доводити своє
            право у виборі гри. Отже, справитися з  найяскравішими емоціями та напруженням дитині є найприроднішим саме через гру.
            При використанні цих ігор – пам’ятайте, все що дитина робить в такій грі, має йти від її бажання та приносити
            результат. Допоможіть дитині помітити цей результат – через розмову або запитання.
            Тут зібрано декілька ігор, які допоможуть дитині зняти підвищене емоційне напруження.
          </Paragraph>

          <Accordion title="Теоретичне пояснення">
            <Paragraph>У дітей емоційна напруга завжди проявляється по-різному.
              Діти можуть ставати мовчазними, уникати друзів, демонструвати ознаки депресії, у них проявляються
              напади роздратування або спалахи люті, в цілому їх поведінка стає дуже важкою, вони часто
              втрачають контроль над собою.Саме керована ігрова діяльність допоможе дитині зменшити емоційне
              напруження.
            </Paragraph>
          </Accordion>

          <Text style={styles.sectionHeader}>Практичні вправи </Text>
          <Accordion title="Гра “Де я?”">
            <Paragraph>
              Спрямована на виведення  дитини з неприємних спогадів та переживань за допомоги фіксації на теперішньому моменті.
            </Paragraph>
            <Paragraph>
              У будь-який час запитуйте дитину "Де ти?", а та у відповідь нехай розповість про навколишнє середовище із залученням всіх
              органів чуття: "Я на вулиці, слухаю шурхіт листя, теплі сонячні промені торкаються обличчя, а у повітрі аромат булочок з кафе поблизу".
            </Paragraph>
          </Accordion>

          <Accordion title="Гра “Розшифрування імені”">
            <Paragraph>Спрямована на перемикання уваги.</Paragraph>
            <Paragraph>До кожної букви імені доберіть позитивну якість характеру, що починається на таку саму букву (наприклад, Оля: Охайна, Ласкава, Яскрава). </Paragraph>
          </Accordion>

          <Accordion title="Гра “Дві маски”">
            <Paragraph>Спрямована на формування почуття внутрішньої сили та збільшення внутрішніх ресурсів.</Paragraph>
            <Paragraph>Потрібно купити, а краще виготовити власноруч з дитиною дві маски.Одна буде “сильною”,
              у ній дитина почуватиметься впевнено; інша — "слабка". Спочатку нехай дитина надягне “сильну” та поговорить за неї. Потім настане черга
              “слабкої” маски, дитина розповість її переживання. Поміркуйте разом, як перша маска може допомогти другій, і коли вона стала б у пригоді йому самому.
              Така гра вчить дитину відстежувати та коригувати свій емоційний стан. Дуже обережно потрібно говорити про почуття дитини, особливо після сильних емоційніх потрясінь.
              Нехай дитина скаже, лише те, що хоче сама, не допитуйтесь та не заглиблюйте в переживання. Зверніть увагу в розмові саме на те, що може перша
              “Маска” дати або запропонувати другій.
            </Paragraph>
          </Accordion>

          <Accordion title="Гра “Пластилін”">
            <Paragraph>Спрямована на відновлення емоційної активності.</Paragraph>
            <Paragraph>Внаслідок психологічної травми обличчя людини (не тільки дитини) часто наче застигає,
              його вираз майже не змінюється. Щоб повернути емоційну активність, візьміть спочатку шматок пластиліну і разом з дитиною розминайте його.
              Потім запропонуйте дитині уявити, що її обличчя — також пластилінове, і почніть його "розминати": смикайте за щічки, прохайте їх надути чи втягнути.
              Урешті-решт, влаштуйте конкурс "кривляки" на найкращу гримасу!
            </Paragraph>
          </Accordion>

          <Accordion title="Гра “Різнокольорові дні”">
            <Paragraph>Спрямована на відновлення відчуття теперішнього часу</Paragraph>
            <Paragraph>Після переживань можуть виникнути проблеми з плином часу, бо пам’ять постійно повертається до неприємних подій.
              Дитина ніби дивиться постійно вглиб себе. Щоб повернути її у теперішній час, підкреслити, що час спливає, призначте кожному дню тижня свій колір
              (дуже зручно — сім днів та сім барв у веселці). Припустимо, четвер у вас зелений. Шукайте цього дня зелені предмети, вибирайте зелені фрукти та овочі,
              одягайте за можливості зелений одяг.
            </Paragraph>
          </Accordion>

          <Accordion title="Вправа “Квітка та свічка”">
            <Paragraph>Вправа спрямована на розслаблення та глибоке дихання.</Paragraph>
            <Bullet symbol="•" style={styles.paragraph}>
              Уявіть, що у вас в одній руці приємно пахне квітка, а в іншій — запалена свічка.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Повільно зробіть вдих через ніс й уявіть, що відчуваєте запах квітки.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Повільно видихніть через рот, наче задуваєте свічку.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Повторіть кілька разів.
            </Bullet>
          </Accordion>

          <Accordion title="Вправа “Лимони”">
            <Paragraph>Вправа спрямована на зняття м’язового напруження.</Paragraph>
            <Bullet symbol="•" style={styles.paragraph}>
              Уявіть, що у вас у руці лимон.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Уявіть, ніби ви підходите до дерева та зриваєте два лимони, по одному в кожну руку.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Сильно здавіть лимони, щоби вичавити сік – вичавлюйте, вичавлюйте, вичавлюйте!
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Киньте лимони на підлогу та розслабте руки.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Потім повторюйте, доки соку не набереться на склянку лимонаду.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Після останнього натискання та кидка струсіть руки, щоби розслабитися.
            </Bullet>
          </Accordion>

          <Accordion title="Вправа “Лінивий кіт”">
            <Paragraph>Вправа спрямована на зняття м’язового напруження.</Paragraph>
            <Bullet symbol="•" style={styles.paragraph}>
              Уявіть, що ви лінивий кіт, який щойно прокинувся після приємного довгого сну.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Широко позіхніть.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Помурчіть, як кіт: "мяу-мяу”.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Тепер витягніть руки, ноги та спину – і потягніться повільно, як кіт. Розслабтеся.
            </Bullet>
          </Accordion>

          <Accordion title="Вправа “Пір’їнка і статуя”">
            <Paragraph>Вправа спрямована на зняття м’язового напруження.</Paragraph>
            <Bullet symbol="•" style={styles.paragraph}>
              Уявіть, що ви пір’їнка, що літає в повітрі приблизно десять секунд.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Раптом ви завмираєте й перетворюєтеся на статую. Не рухайтеся!
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Потім повільно розслабтеся, знову перетворюючись на пір’їнку, що літає в повітрі.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Повторіть кілька разів. Переконайтеся, що закінчите пір’їнкою в розслабленому стані.
            </Bullet>
          </Accordion>

          <Accordion title="Вправа “М’яч для зняття стресу”">
            <Paragraph>Вправа спрямована на зняття м’язового напруження та масаж рук.</Paragraph>
            <Bullet symbol="•" style={styles.paragraph}>
              Зробіть собі м’ячик для зняття стресу. Наприклад, для цього ви можете наповнити повітрян
              і кульки сухим горохом або рисом.</Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Візьміть м’яч у руку, можете взяти два в обидві руки, стисніть м’яч і розслабте руку.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Поекспериментуйте зі стисканням м’яча. Знайдіть спосіб, який підходить саме вам, змінюйте ш
              видкість стискання, силу та тривалість стискань так, як вам буде подобатися.</Bullet>
          </Accordion>

          <Accordion title="Вправа “Черепаха”">
            <Paragraph>Вправа спрямована на зняття м’язового напруження.</Paragraph>
            <Bullet symbol="•" style={styles.paragraph}>
              Уявіть, що ви черепаха, яка йде на повільну, розслаблену прогулянку.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Уявіть, ніби раптово почався дощ.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Щільно згорніться в калачик під панциром десь на десять секунд.
            </Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              ПУявіть, що знову вийшло сонце, тому можна вилазити з панцира та продовжити розслаблену прог
              улянку.</Bullet>
            <Bullet symbol="•" style={styles.paragraph}>
              Повторіть кілька разів. Переконайтеся, що завершуєте вправу прогулянкою, щоби ваше тіло розс
              лабилося.</Bullet>
          </Accordion>

          <Accordion title="Вправа “Корабель і вітер”">
            <Paragraph>Вправа спрямована на стабілізацію емоційного стану.</Paragraph>
            <Paragraph>
              Уявіть собі, що наш вітрильник пливе по хвилях, але раптом він зупинився. Давайте допоможемо йому і запросимо на допомогу вітер.
              Вдихніть в себе повітря, сильно втягніть щоки... А тепер голосно видихніть через рот повітря, і нехай вирвався на волю вітер підганяє кораблик. Давайте спробуємо ще раз.
              Я хочу почути, як шумить вітер! Вправу можна повторити 3 рази.
            </Paragraph>
          </Accordion>

          <Accordion title="Вправа «Сопілочка»">
            <Paragraph>Вправа спрямована на розслаблення м’язів обличчя</Paragraph>
            <Paragraph>
              Давайте пограємо на сопілочці. Неглибоко вдихніть повітря, піднесіть уявну сопілку до губ. Починайте повільно видихати,
              і на видиху спробуйте витягнути губи в трубочку. Потім почніть спочатку. Грайте! Який чудовий оркестр!
            </Paragraph>
          </Accordion>

          <Accordion title="Вправа “Рот на замок”">
            <Paragraph>Вправа спрямована на розслаблення м’язів губ та нижньої щелепи.</Paragraph>
            <Paragraph>
              Уявить собі, як би міг виглядати насправді образний вираз “Рот на замок!”. Сильно стисніть губи. Тепер, не відпускаючи, підтисніть їх так,
              щоб їх зовсім не було видно. Так потрібно протриматися кілька секунд, а потім можна розслабити губи. Підкресліть, що тепер губи стали знову м'якими і розслабленими.
            </Paragraph>
            <Paragraph>
              Цю гру бажано повторити кілька разів для більшого ефекту. Щоб дитині не стало нудно, можна чергувати її з аналогічною грою “Слон”, коли дитина витягує губи вперед трубочкою,
              зображуючи хобот слона, а потім розслаблює їх.
            </Paragraph>

          </Accordion>

          {/*15 */}
          <Accordion title="Вправа “Повітряна кулька”">
            <Paragraph>Вправа спрямована на розслаблення м’язів живота.</Paragraph>
            <Paragraph>
              Для початку згадайте з дитиною, коли ви в останній раз надували повітряні кулі. Як змінюється обсяг кульки коли ми її надуваємо?
              Звичайно, вона збільшується в розмірі і напружується, стінки її стають пружними і їх непросто продавити пальцем. Тепер нехай дитина уявить себе такою повітряною кулею.
              Потрібно зробити дуже глибокий вдих і затамувати подих. Попросіть покласти руку на живіт і відчути, чи став він круглим і напруженим. Якщо почав,
              то можна видихнути і відчути, як приємно, коли живіт розслаблений. Повторіть гру ще три-п'ять разів: напруження на вдиху, затримка на кілька секунд,
              видих і розслаблення.
            </Paragraph>
            <Paragraph>
              Примітка. Зверніть увагу на те, щоб напружувався саме живіт, простежте за плечима дитини - вони не повинні підніматися.
              Другий важливий момент - видих повинен бути зроблений без зусилля, повітря саме вийде, якщо перестати напружувати живіт.
            </Paragraph>
          </Accordion>

          <Accordion title="Вправа “Хто сильніше”">
            <Paragraph>Вправа спрямована на формування почуття безпеки.</Paragraph>
            <Paragraph>
              Запропонуйте дитині обійнятися. Можна спробувати вимірювати силу обіймів «Обійми мене сильніше ніж я тебе». Призначте її головною за підрахунок обіймів за день.
            </Paragraph>
          </Accordion>

          <Accordion title="Вправа “Ліпимо своє тіло”">
            <Paragraph>Вправа спрямована на відновлення відчуття контакту з власним тілом.</Paragraph>
            <Paragraph>
              Можна зайнятися ніби «ліпкою» - ліпимо тіло як пластилін. Вчимо дитину робити це разом з вами. Таким чином дитина, вивчає межі свого тіла та навчається саморегуляції через відчуття свого тіла.
            </Paragraph>
          </Accordion>

          <Accordion title="Вправа “Я у схованці”">
            <Paragraph>Вправа спрямована на формування почуття безпеки.</Paragraph>
            <Paragraph>
              Посадіть дитину спинкою до себе та міцно обійміть. В залежності від ситуації та часу, можна трохи погойдувати.
            </Paragraph>
          </Accordion>

          <Accordion title="Вправа “У мене кругла голова”">
            <Paragraph>Вправа спрямована на відновлення відчуття контакту з власним тілом.</Paragraph>
            <Paragraph>Промовлянка, з віддтворенням рухів:</Paragraph>
            <Bullet style={styles.paragraph}>
              У мене кругла голова
            </Bullet>
            <Bullet style={styles.paragraph}>
              Очка два, вушка два,
            </Bullet>
            <Bullet style={styles.paragraph}>
              Ніс один і рот маленький,
            </Bullet>
            <Bullet style={styles.paragraph}>
              І волоссячко біленьке.
            </Bullet>
          </Accordion>

          <Accordion title="Доброго ранку”">
            <Paragraph>
              Вправа спрямована на відновлення відчуття контакту навколишнім світом.
            </Paragraph>
            <Paragraph>
              Прокидаючись вранці можна запропонувати дитині таку промовлянку: – Пальцями правої руки по черзі „вітатися" з пальцями лівої руки,
              торкаючись один до одного кінчиками.
            </Paragraph>
            <Bullet style={styles.paragraph}>
              Доброго ранку
            </Bullet>
            <Bullet style={styles.paragraph}>
              Доброго ранку, сонце привітне!
            </Bullet>
            <Bullet style={styles.paragraph}>
              Доброго ранку, небо блакитне!
            </Bullet>
            <Bullet style={styles.paragraph}>
              Доброго ранку, у небі пташки!
            </Bullet>
            <Bullet style={styles.paragraph}>
              Доброго ранку тобі i мeнi!
            </Bullet>
            <Paragraph>
              Пальцями правої руки по черзі “вітатися” з пальцями лівої руки, торкаючись один до одного кінчиками.
            </Paragraph>
          </Accordion>

          <Accordion title="Пальчикові ігри">
            <Paragraph>
              Вправа спрямована на розслаблення м’язів рук та пальців.
            </Paragraph>
            <Bullet style={styles.paragraph}>
              Перший пальчик — наш дiдycь,
            </Bullet>
            <Bullet style={styles.paragraph}>
              Другий пальчик — то бабуся,
            </Bullet>
            <Bullet style={styles.paragraph}>
              Третій пальчик — наш татусь,
            </Bullet>
            <Bullet style={styles.paragraph}>
              А четвертий — то матуся,
            </Bullet>
            <Bullet style={styles.paragraph}>
              А мізинчик — наш малюк,
            </Bullet>
            <Bullet style={styles.paragraph}>
              Biн сховався тут.
            </Bullet>
            <Paragraph>
              Показуємо на пальчик та кажемо: “перший пальчик”..., i продовжуємо гру, загинаючи кожен пальчик
            </Paragraph>
            <Bullet style={styles.paragraph}>Задрімав мізинчик трішки,</Bullet>
            <Bullet style={styles.paragraph}>Безіменний — стриб у ліжко,</Bullet>
            <Bullet style={styles.paragraph}>А середній там лежить,</Bullet>
            <Bullet style={styles.paragraph}>Вказівний давно вже спить.</Bullet>
            <Bullet style={styles.paragraph}>Вранці вci вони схопились враз</Bullet>
            <Bullet style={styles.paragraph}>В дитсадочок бігти час.</Bullet>
            <Paragraph>
              По черзі загинаємо пальчики до долоні.Потім великим пальцем торкаємося всіх інших - “будимо”.Розкриваємо всі пальці “враз”.
            </Paragraph>
            <Bullet style={styles.paragraph}>Старший встав — не лінувався.</Bullet>
            <Bullet style={styles.paragraph}>Вказівний за ним піднявся —</Bullet>
            <Bullet style={styles.paragraph}>Розбудив сусід його.</Bullet>
            <Bullet style={styles.paragraph}>Той — свого, а той свого.</Bullet>
            <Bullet style={styles.paragraph}>Встали вчасно вci брати —</Bullet>
            <Bullet style={styles.paragraph}>На роботу треба йти.</Bullet>
            <Paragraph>
              Стиснути пальчики в кулачок.По черзі розгинати їх, починаючи з великого.А зі словами: “Встали вчасно вci...” широко розчепірити пальці.
            </Paragraph>
          </Accordion>

          <View style={styles.spacer} />
        </View>
      </ScrollView>
    </View>
  );
}
