import React from "react";
import { Text, View, ScrollView } from "react-native";
import { ThemeContext } from "/components/ThemeProvider";
import { FontSizeContext } from "/components/FontSizeProvider";
import Bullet from "/components/Bullet";
import Header from "/components/Header";
import resolveStyles from "/styles/subpage";
import Accordion from "/components/Accordion";

export default function Diti({ navigation }) {
  const { computeTheme } = React.useContext(ThemeContext);
  const { computeFontSize } = React.useContext(FontSizeContext);
  const styles = resolveStyles(computeTheme(), computeFontSize);


  return (
    <View>
      <Header backButton navigation={navigation} />
      <ScrollView>
        <View style={styles.container}>
          <Text style={styles.header}>Діти</Text>

          <Text style={styles.paragraph}>Одразу після того, як питання збереження життя та здоров’я є вирішеним,
            виникає наступне – як допомогти малечі справитися з таким емоційним навантаженням, до якого вона не
            готова. У цьому розділі ви побачите вправи та ігри, які допоможуть краще зрозуміти вашу дитину та
            підтримати її в її, не менш важливих, ніж у дорослого, переживаннях.</Text>

          {/*1 from 1 */}
          <Accordion title="Теоретичне пояснення">

            <Text style={styles.paragraph}>Є певні особливості дитячого сприймання, на які потрібно зважати,
              і особливо в ці непрості часи. Чим менша дитина – тим більше переважає тілесно-емоційний рівень
              сприймання та інстинктивні реакції переважають. Дорослому тут важливо бути поряд та дати дитині відчуття
              контакту та довіри. Дитина сприймає те що відбувається на раціональному рівні – вона може не знати слів,
              щоб пояснити свої відчуття чи переживання. Тобто дорослому тут важливо пропонувати дитині слова або дії,
              щоб виразити чи прожити ті чи інші відчуття чи події. Світ діти сприймають цілісно та емоційно
              насичено – тож використовуйте емоційність в спілкуванні та відповідях на її запитання. Також,
              не варто забувати про наявні у дітей егоцентричні прояви – в стресових ситуаціях, якщо дитина
              не отримає пояснень від дорослого про причини – може пов’язати причини з собою
              (поведінкою, успішністю в школі і т.ін.). Тому дуже важливо говорити з дитиною, пояснювати з
              раціонального боку, те що відбувається. Чим менша дитина – тим менше використовуйте слів,
              тим простіше пояснюйте. Використовуйте ті приклади, які є зрозумілими дитині з її особистого досвіду.
              Діти вірять дорослим, вчаться у них. Та вчаться не тому що їм розказують – а тому, що їм показують.
              Отже, якщо ви хоче щоб дитина справлялась з гострими емоційними напруженнями та мала довільну емоційну
              саморегуляцію – в першу чергу, потрібно показати їй, як справляєтесь ви.</Text>

          </Accordion>

          <Text style={styles.paragraph}>Практичні вправи</Text>

          {/*1 from 4 */}
          <Accordion title="Вправа “Моє дерево”">

            <Text style={styles.paragraph}>Вправа “Моє дерево” спрямована на відновлення почуття спокою та відновлення внутрішніх ресурсів. </Text>
            <Text style={styles.paragraph}>Підійди до дерева та уважно подивись на нього.
              Дерево має товстий стовбур і багато гілок із зеленим листям. Ти бачиш його потужне коріння?
              Ним дерево всмоктує воду з землі. А бачиш багато листя? Воно дає дереву тепле світло від сонця.
              Завдяки корінню та листям дерево отримує все необхідне,  щоб залишатися здоровим та мати змогу рости.</Text>
            <Text style={styles.paragraph}>А тепер уяви, що ти торкаєшся дерева. Якщо хочеш, можеш уявити, що ти зливаєшся з деревом і сам стаєш ним. Або можеш просто обійняти дерево.
              А зараз уяви, як ти, подібно до дерева, всмоктуєш воду з землі. Уяви, як ти, подібно до дерева, отримуєш тепле світло від сонця.
              Приємне відчуття, чи не так?
              А потім подумай: чи є щось, що тобі наразі потрібно, щоб почуватися добре? Можливо, ти хочеш, щоб хтось сказав тобі щось приємне? Або, можливо, ти хочеш, щоб хтось посміхнувся тобі чи обійняв тебе? А може тобі потрібно щось зовсім інше.
              А тепер уяви, що ти отримуєш саме те, що тобі потрібно, щоб почуватися добре. Так само, як дерево отримує все через коріння і листя, щоб залишатися здоровим та мати змогу рости.
              Ти помічаєш, яке це добре відчуття, і як ти стаєш все більшим і сильнішим? Насолоджуйся цим відчуттям деякий час...
              А потім знову повільно відокремся від дерева.
              Ти завжди можеш повернутися до свого дерева, якщо захочеш підзарядитися енергією. За допомогою свого дерева ти можеш отримати те, що тобі потрібно!
              А потім повільно поверни свою увагу до кімнати. Повільно відкрий очі, потягнися, після чого ти знову почуватимешся бадьоро.
              Також можеш намалювати своє дерево, якщо захочеш!</Text>

          </Accordion>
          {/*2 from 4 */}
          <Accordion title="Вправа “Коробка”">

            <Text style={styles.paragraph}>Вправа “Коробка” допоможе на деякий час заблокувати погані спогади та образи в голові.
              А саме – доти, поки ти не будеш у готовності сприйняти їх.</Text>
            <Text style={styles.paragraph}>Уяви собі коробку. Справді надійну коробку, яку можна закрити.
              Наскільки велика ця коробка? Тобі достатньо коробки середнього розміру чи потрібна дуже велика, або,
              можливо, тобі треба кілька коробок? Торкнися коробки. З якого матеріалу виготовлена коробка?
              Відчуй, наскільки товстий матеріал, чи не проникає через нього нічого. Якого кольору коробка?
              Коробка також має міцні навісні замки. Доторкнися й перевір також замки — вони дійсно міцні й
              надійно замикаються!</Text>

          </Accordion>
          {/*3 from 4 */}
          <Accordion title="Вправа “Лимони, черепахи та жаби”">

            <Text style={styles.paragraph}>За допомогою цієї вправи можна навчитися розслабляти м‘язи.
              Слідкуй за відчуттям у м‘язах, коли вони напружені та коли ти їх розслабляєш.</Text>
            <Text style={styles.paragraph}>Лягай у зручному положенні. Нехай руки вільно лежать поруч.
              Можеш закрити очі або дивитися на стелю. Слідкуй за тим, що ти відчуваєш у своєму тілі.
              Спочатку стисни руки в кулаки. Уяви, що у тебе в руках великі лимони. Міцно стисни їх.
              Спробуй вичавити з лимонів увесь сік. Слідкуй за напругою в кистях і руках…А тепер просто дай
              лимонам випасти. Зверни увагу на відчуття в руках, коли вони розслаблені.</Text>
            <Text style={styles.paragraph}>Тепер настав час напружити плечі. Уяви, що ти черепаха.
              Втягни голову в панцир. Спробуй високо підняти плечі, аж до вух. Залишайся у такому положенні
              декілька секунд і відчуй напругу в плечах і шиї… Тепер висунь голову з панцира.
              Тепер ти можеш розслабитися і почуватися дійсно добре.</Text>
            <Text style={styles.paragraph}>Наостанок скорч кумедну гримасу. Міцно прижмур очі, зморщ ніс,
              стисни зуби та широко посміхнися. Потримай трохи цю напругу... тепер знову розслабся.</Text>
            <Text style={styles.paragraph}>Тепер уяви, що ти кіт, який хоче протиснутися через вузький дверний отвір,
              щоб переслідувати мишу. Тобі треба зробитися дуже тонким і втягнути живіт, щоб цього досягти...
              Тобі це вдалося! Можеш тепер розслабити живіт — тобі більше не потрібно витягуватися.
              Розслабся і відчуй, як живіт стає м‘яким і теплим.</Text>
            <Text style={styles.paragraph}>А тепер уяви, що ти жаба і хочеш перестрибнути через великий стовбур.
              Ти починаєш стрибати: Напруж усі м‘язи в ногах і стрибай, розпрямляючи ноги. Зберігай напруження в
              ногах!Тобі це вдалося! Тепер розслаб ноги і стопи.</Text>

          </Accordion>
          {/*4 from 4 */}
          <Accordion title="Вправа “Хитра пальчикова гра”">

            <Text style={styles.paragraph}>Вправа спрямована на перемикання уваги.</Text>

            <Bullet symbol="1" style={styles.paragraph}>
              Поклади лівий вказівний палець на правий великий палець і тримай їх так, аж поки покладеш правий
              вказівний палець на лівий великий палець. Перевертай їх і два нижні піднімуться вгору, а два верхніх,
              навпаки, опустяться вниз. </Bullet>
            <Bullet symbol="2" style={styles.paragraph}>Торкнися кінчиком великого пальця до кінчиків решти пальців
              на даній руці. Вказівним пальцем пройдися по рядку до мізинця і назад. Виконай вправу лівою і
              правою рукою по черзі.  </Bullet>

          </Accordion>

          <Text style={styles.paragraph}>Дихальні вправи</Text>

          {/*1 from 5 */}
          <Accordion title="“Подих сосни”">

            <Text style={styles.paragraph}>Стоячи або сидячи, на вдиху підіймай руки, як гілля сосни,
              яке тягнеться високо до хмаринок. Видихаючи, уявляй,
              що з твоїх ніг глибоко в землю проростає коріння як в дерева.</Text>

          </Accordion>

          {/*2 from 5 */}
          <Accordion title="“Подих дельфіна”">

            <Text style={styles.paragraph}>Зроби вдих високо піднімаючи руки. Видихни, уявляючи, як ти занурюєшся глибоко в океан.</Text>

          </Accordion>

          {/*3 from 5 */}
          <Accordion title="“Дихання-обіймашки”">

            <Text style={styles.paragraph}>Заплющ очі, поклади праву ручку на ліве плечико,
              а ліву ручку на праве плечико і м’якесенько роби вдих та видих.</Text>

          </Accordion>

          {/*4 from 5 */}
          <Accordion title="“Втримати пір’ячко”">

            <Text style={styles.paragraph}>Уяви, що перед твоїм носом на відстані 10-15 см висить пушинка.
              Дихай тільки носом і так плавно, щоб пушинка не ​​коливалася.</Text>

          </Accordion>

          {/*5 from 5 */}
          <Accordion title="“Дихання плюшевого ведмедика”">

            <Text style={styles.paragraph}>Лягай на спинку та поклади іграшкового ведмедика на живіт.
              Коли ти робиш вдих та видих спостерігай як твій ведмедик підіймається та опускається.</Text>

          </Accordion>


          <View style={styles.spacer} />
        </View>
      </ScrollView>
    </View>
  );
}

